<a href="https://colab.research.google.com/github/noushadkhan01/kansepur-flyash-project/blob/master/10%20aug%20to%2015%20sept%20bill7/kansepur_flyash_bill_10_aug_to_15_sept.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
from google.colab import drive

In [2]:
drive.mount('mydrive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3Aietf%3Awg%3Aoauth%3A2.0%3Aoob&scope=email%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdocs.test%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive.photos.readonly%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at mydrive

In [3]:
!ls

mydrive  sample_data

In [4]:
%cd mydrive/
!ls

/content/mydrive
'My Drive'

In [5]:
%cd My Drive/kansepur flyash project

/content/mydrive/My Drive/kansepur flyash project

In [6]:
!ls

 1_14_feb_bill.xlsx
 11_mar_to_5_apr.xlsx
'16 sept to 1 oct bill8.xlsx'
'16 sept to 30 sept bill8 2.xlsx'
'kansepur bill2.xlsx'
 kansepur_bill3.xlsx
 kansepur_bill4.xlsx
'kansepur flyash bill 10 aug to 15 sept bill7.xlsx'
 kansepur_soil_bill.xlsx

In [0]:
import pandas as pd

In [9]:
df = pd.read_excel('kansepur flyash bill 10 aug to 15 sept bill7.xlsx', 'Sheet1')
df.head()

   S.No.       Date Counts    Name  Quantity   Diesel
0    1.0 2019-08-10      1   imran     397.0   5000.0
1    2.0        NaT      2  julfan     390.0      NaN
2    3.0        NaT      3  julfan     390.0      NaN
3    4.0        NaT      4   imran     397.0      NaN
4    5.0 2019-08-11      1   imran     397.0  13000.0

In [11]:
df.tail(4)

     S.No. Date              Counts      Name   Quantity    Diesel
449  450.0  NaT                  29  mukarram     400.00       NaN
450    NaN  NaT        Total Qty. =       NaN  178753.00  425000.0
451    NaN  NaT    Amt = Qty * 4.25       NaN  759700.25       NaN
452    NaN  NaT  Balance = amt -dsl       NaN  334700.25       NaN

In [12]:
df = df[:-3]
df.tail(2)

     S.No. Date Counts      Name  Quantity  Diesel
448  449.0  NaT     28  khurseed     391.0     NaN
449  450.0  NaT     29  mukarram     400.0     NaN

In [0]:
maap = {'imran':397, 'julfan':390, 'gulfam':411, 'saddam': 465, 'khurseed': 391, 'jabir': 416, 
        'akram': 360, 'wajid': 357, 'kayum': 308, 'bhura': 397, 'zishan': 484, 'amjad':397, 'rasid':406
        ,'mujahid':380, 'mukarram':400, 'jahid':435,'khan':425, 'dinesh':465
        }

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 450 entries, 0 to 449
Data columns (total 6 columns):
S.No.       450 non-null float64
Date        23 non-null datetime64[ns]
Counts      450 non-null object
Name        450 non-null object
Quantity    450 non-null float64
Diesel      23 non-null float64
dtypes: datetime64[ns](1), float64(3), object(2)
memory usage: 21.2+ KB

##fill values

In [15]:
df.columns

Index(['S.No.', 'Date', 'Counts', 'Name', 'Quantity', 'Diesel'], dtype='object')

In [16]:
df.Quantity.isnull().sum()

0

In [0]:
def fill_quantity(a):
  name, qty = a
  if pd.isnull(qty):
    return maap.get(name)
  return qty

In [0]:
df['Quantity'] = df[['Name', 'Quantity']].apply(fill_quantity, axis = 1)

In [19]:
df.Quantity.isnull().sum()

0

In [0]:
import numpy as np

In [21]:
df.Quantity[:3]

0    397.0
1    390.0
2    390.0
Name: Quantity, dtype: float64

df.to_excel('kansepur flyash bill 10 aug to 11 sept bill7.xlsx', index = False)

from google.colab import files

files.download('kansepur flyash bill 10 aug to 11 sept bill7.xlsx')

In [22]:
unique_dates = df.Date.unique()
unique_dates = pd.Series(unique_dates).dropna()
print(unique_dates)

0    2019-08-10
2    2019-08-11
3    2019-08-22
4    2019-08-23
5    2019-08-24
6    2019-08-25
7    2019-08-28
8    2019-08-29
9    2019-09-01
10   2019-09-02
11   2019-09-03
12   2019-09-04
13   2019-09-05
14   2019-09-06
15   2019-09-07
16   2019-09-08
17   2019-09-09
18   2019-09-10
19   2019-09-11
20   2019-09-12
21   2019-09-13
22   2019-09-14
23   2019-09-15
dtype: datetime64[ns]

In [23]:
df.Date.nunique()

23

In [24]:
df.Date.value_counts()

2019-09-12    1
2019-08-22    1
2019-08-23    1
2019-09-06    1
2019-09-03    1
2019-09-14    1
2019-08-28    1
2019-09-11    1
2019-08-11    1
2019-08-25    1
2019-09-08    1
2019-09-05    1
2019-08-29    1
2019-09-02    1
2019-09-13    1
2019-09-10    1
2019-08-10    1
2019-08-24    1
2019-09-07    1
2019-09-04    1
2019-09-01    1
2019-09-15    1
2019-09-09    1
Name: Date, dtype: int64

In [0]:
import numpy as np

In [26]:
df.Name.unique()

array(['imran', 'julfan', 'gulfam', 'khurseed', 'saddam', 'jabir',
       'amjad', 'kayum', 'akram', 'bhura', 'wajid', 'mehmood', 'rasid',
       'zishan', 'jahid', 'khan', 'mujahid', 'mukarram', 'dinesh'],
      dtype=object)

In [27]:
total_quantity = sum(df.Quantity)
total_quantity

178753.0

In [28]:
rounds_per_name = df.Name.value_counts()
rounds_per_name

imran       57
gulfam      47
khurseed    44
akram       41
bhura       36
saddam      36
julfan      32
kayum       27
jabir       27
wajid       25
rasid       24
zishan      15
mukarram    10
mujahid      7
khan         7
mehmood      4
jahid        4
dinesh       4
amjad        3
Name: Name, dtype: int64

In [29]:
sum(rounds_per_name.values)

450

## unique feets per name

In [30]:
group = df.groupby(df.Name)
group

for i, j in group:
  print(i, '\n', j.Quantity, '\n')

In [31]:
for i, j in group:
  print(i, j.Quantity.unique(), '\n')

akram [360.]

amjad [397.]

bhura [397.]

dinesh [465.]

gulfam [411.]

imran [397.]

jabir [416.]

jahid [435.]

julfan [390.]

kayum [308.]

khan [425.]

khurseed [391. 341.]

mehmood [308. 357. 397. 416.]

mujahid [380.]

mukarram [400.]

rasid [406.]

saddam [465.]

wajid [357.]

zishan [484.]

# Diesel

In [79]:
diesel = pd.read_excel('kansepur flyash bill 10 aug to 15 sept bill7.xlsx', 'Diesel')
diesel.head()

        Date       Name  Diesel   Cash  bharai
0 2019-08-09     julfan     0.0    NaN   250.0
1        NaT      imran     0.0    NaN   250.0
2        NaT  vakil jcb  3000.0    NaN     NaN
3 2019-08-10      imran  1500.0  500.0     NaN
4        NaT     julfan  1500.0    NaN     NaN

In [80]:
diesel.shape

(246, 5)

In [81]:
diesel.Date.unique()

array(['2019-08-09T00:00:00.000000000',                           'NaT',
       '2019-08-10T00:00:00.000000000', '2019-08-11T00:00:00.000000000',
       '2019-08-14T00:00:00.000000000', '2019-09-18T00:00:00.000000000',
       '2019-08-22T00:00:00.000000000', '2019-08-23T00:00:00.000000000',
       '2019-08-24T00:00:00.000000000', '2019-08-25T00:00:00.000000000',
       '2019-08-26T00:00:00.000000000', '2019-08-27T00:00:00.000000000',
       '2019-08-28T00:00:00.000000000', '2019-08-29T00:00:00.000000000',
       '2019-09-01T00:00:00.000000000', '2019-09-02T00:00:00.000000000',
       '2019-09-03T00:00:00.000000000', '2019-09-04T00:00:00.000000000',
       '2019-09-05T00:00:00.000000000', '2019-09-06T00:00:00.000000000',
       '2019-09-07T00:00:00.000000000', '2019-09-08T00:00:00.000000000',
       '2019-09-09T00:00:00.000000000', '2019-09-10T00:00:00.000000000',
       '2019-09-11T00:00:00.000000000', '2019-09-12T00:00:00.000000000',
       '2019-09-13T00:00:00.000000000', '2019-09-14T00:00:00.000000000',
       '2019-09-15T00:00:00.000000000'], dtype='datetime64[ns]')

In [0]:
for n, i in enumerate(diesel.Date.values):
  if not pd.isnull(i):
    date = i
  else:
    diesel.iloc[n, 0] = date

In [83]:
diesel.head()

        Date       Name  Diesel   Cash  bharai
0 2019-08-09     julfan     0.0    NaN   250.0
1 2019-08-09      imran     0.0    NaN   250.0
2 2019-08-09  vakil jcb  3000.0    NaN     NaN
3 2019-08-10      imran  1500.0  500.0     NaN
4 2019-08-10     julfan  1500.0    NaN     NaN

In [84]:
diesel.tail()

          Date     Name   Diesel     Cash  bharai
241 2019-09-15  tractor   1180.0      NaN     NaN
242 2019-09-15      car    500.0      NaN     NaN
243 2019-09-15     cash   3500.0      NaN     NaN
244 2019-09-15    total  30500.0      NaN     NaN
245 2019-09-15      NaN      NaN  61049.0     NaN

In [85]:
diesel = diesel[:-1]
diesel.tail(2)

          Date   Name   Diesel  Cash  bharai
243 2019-09-15   cash   3500.0   NaN     NaN
244 2019-09-15  total  30500.0   NaN     NaN

# pivot table

In [86]:
pivot_diesel = diesel.pivot_table(index = 'Name', columns = 'Date', values = 'Diesel')
pivot_diesel

Date       2019-08-09  2019-08-10  ...  2019-09-15  2019-09-18
Name                               ...
akram             NaN         NaN  ...      2000.0         NaN
amjad             NaN         NaN  ...         NaN         NaN
bhada jcb         NaN         NaN  ...         NaN         NaN
bhura             NaN         NaN  ...         0.0         NaN
car               NaN         NaN  ...       500.0         NaN
cash              NaN         NaN  ...      3500.0         NaN
dinesh            NaN         NaN  ...      1820.0         NaN
gulfam            NaN         NaN  ...      2000.0         NaN
imran             0.0      1500.0  ...      2000.0         NaN
jabir             NaN         NaN  ...      2000.0         NaN
jahid             NaN         NaN  ...         NaN         NaN
julfan            0.0      1500.0  ...         0.0         0.0
kayum             NaN         NaN  ...         NaN         NaN
khan              NaN         NaN  ...      2000.0         NaN
khurseed          NaN         NaN  ...         NaN         NaN
mujahid           NaN         NaN  ...      2000.0         NaN
mukarram          NaN         NaN  ...      2000.0         NaN
rasid             NaN         NaN  ...      2000.0         NaN
sabir jcb         NaN         NaN  ...         NaN         NaN
saddam            NaN         NaN  ...      2000.0         NaN
total             NaN      5000.0  ...     30500.0         NaN
tractor           NaN         NaN  ...      1180.0         NaN
vakil jcb      3000.0      2000.0  ...      3500.0         NaN
wajid             NaN         NaN  ...         NaN         NaN
zishan            NaN         NaN  ...      2000.0         NaN

[25 rows x 28 columns]

In [87]:
pivot_cash = diesel.pivot_table(index = 'Name', columns = 'Date', values = 'Cash')
pivot_cash

Date       2019-08-10  2019-08-11  ...  2019-09-15  2019-09-18
Name                               ...
akram             NaN         NaN  ...       500.0         NaN
bhura             NaN         NaN  ...       100.0         NaN
dinesh            NaN         NaN  ...         NaN         NaN
gulfam            NaN         NaN  ...         NaN         NaN
imran           500.0         NaN  ...         NaN         NaN
jabir             NaN         NaN  ...      4040.0         NaN
jahid             NaN         NaN  ...         NaN         NaN
julfan            NaN         NaN  ...       400.0       600.0
kayum             NaN         NaN  ...         NaN         NaN
khurseed          NaN       500.0  ...         NaN         NaN
saddam            NaN         NaN  ...         NaN         NaN
vakil jcb         NaN         NaN  ...         NaN         NaN
wajid             NaN         NaN  ...         NaN         NaN

[13 rows x 25 columns]

In [0]:
pivot_diesel.fillna(value = 0, inplace = True)

In [0]:
pivot_cash.fillna(value = 0, inplace = True)

In [90]:
pivot_diesel.head(2)

Date   2019-08-09  2019-08-10  2019-08-11  ...  2019-09-14  2019-09-15  2019-09-18
Name                                       ...
akram         0.0         0.0         0.0  ...      2000.0      2000.0         0.0
amjad         0.0         0.0         0.0  ...         0.0         0.0         0.0

[2 rows x 28 columns]

In [91]:
pivot_cash.head(1)

Date   2019-08-10  2019-08-11  2019-08-14  ...  2019-09-14  2019-09-15  2019-09-18
Name                                       ...
akram         0.0         0.0         0.0  ...      1000.0       500.0         0.0

[1 rows x 25 columns]

In [92]:
pivot_diesel['Total Diesel'] = pd.Series([0 for i in range(len(pivot_diesel))])
pivot_diesel.head(1)

Date   2019-08-09 00:00:00  ...  Total Diesel
Name                        ...
akram                  0.0  ...           NaN

[1 rows x 29 columns]

In [93]:
pivot_cash['Total Cash'] = pd.Series([0 for i in range(len(pivot_cash))])
pivot_cash.head(1)

Date   2019-08-10 00:00:00  ...  Total Cash
Name                        ...
akram                  0.0  ...         NaN

[1 rows x 26 columns]

In [0]:
for i in range(len(pivot_diesel)):
  pivot_diesel['Total Diesel'][i] = sum(pivot_diesel.iloc[i, 0:-1])

In [95]:
pivot_diesel

Date       2019-08-09 00:00:00  ...  Total Diesel
Name                            ...
akram                      0.0  ...       21000.0
amjad                      0.0  ...        4000.0
bhada jcb                  0.0  ...       12000.0
bhura                      0.0  ...       24000.0
car                        0.0  ...        1500.0
cash                       0.0  ...       53000.0
dinesh                     0.0  ...        3820.0
gulfam                     0.0  ...       30500.0
imran                      0.0  ...       35500.0
jabir                      0.0  ...       16000.0
jahid                      0.0  ...        4000.0
julfan                     0.0  ...       22500.0
kayum                      0.0  ...       16500.0
khan                       0.0  ...        4000.0
khurseed                   0.0  ...       31500.0
mujahid                    0.0  ...        4000.0
mukarram                   0.0  ...        5000.0
rasid                      0.0  ...       14000.0
sabir jcb                  0.0  ...        2500.0
saddam                     0.0  ...       26000.0
total                      0.0  ...      423000.0
tractor                    0.0  ...        1180.0
vakil jcb               3000.0  ...       72000.0
wajid                      0.0  ...       13000.0
zishan                     0.0  ...        9500.0

[25 rows x 29 columns]

In [0]:
for i in range(len(pivot_cash)):
  pivot_cash['Total Cash'][i] = sum(pivot_cash.iloc[i, 0:-1])

In [97]:
pivot_cash.head(2)

Date   2019-08-10 00:00:00  ...  Total Cash
Name                        ...
akram                  0.0  ...      3700.0
bhura                  0.0  ...      2100.0

[2 rows x 26 columns]

In [98]:
diesel_by_name = pivot_diesel[['Total Diesel']]
diesel_by_name

Date       Total Diesel
Name
akram           21000.0
amjad            4000.0
bhada jcb       12000.0
bhura           24000.0
car              1500.0
cash            53000.0
dinesh           3820.0
gulfam          30500.0
imran           35500.0
jabir           16000.0
jahid            4000.0
julfan          22500.0
kayum           16500.0
khan             4000.0
khurseed        31500.0
mujahid          4000.0
mukarram         5000.0
rasid           14000.0
sabir jcb        2500.0
saddam          26000.0
total          423000.0
tractor          1180.0
vakil jcb       72000.0
wajid           13000.0
zishan           9500.0

In [99]:
name1 = set(diesel_by_name.index)
name1

{'akram',
 'amjad',
 'bhada jcb',
 'bhura',
 'car',
 'cash',
 'dinesh',
 'gulfam',
 'imran',
 'jabir',
 'jahid',
 'julfan',
 'kayum',
 'khan',
 'khurseed',
 'mujahid',
 'mukarram',
 'rasid',
 'sabir jcb',
 'saddam',
 'total',
 'tractor',
 'vakil jcb',
 'wajid',
 'zishan'}

In [100]:
name2 = set(df.Name.unique())
name2

{'akram',
 'amjad',
 'bhura',
 'dinesh',
 'gulfam',
 'imran',
 'jabir',
 'jahid',
 'julfan',
 'kayum',
 'khan',
 'khurseed',
 'mehmood',
 'mujahid',
 'mukarram',
 'rasid',
 'saddam',
 'wajid',
 'zishan'}

In [101]:
name1 - name2

{'bhada jcb', 'car', 'cash', 'sabir jcb', 'total', 'tractor', 'vakil jcb'}

In [102]:
cash_by_name = pivot_cash[['Total Cash']]
cash_by_name

Date       Total Cash
Name
akram          3700.0
bhura          2100.0
dinesh          560.0
gulfam         6100.0
imran          7600.0
jabir          6040.0
jahid          1000.0
julfan         4850.0
kayum           587.0
khurseed       8650.0
saddam         5362.0
vakil jcb     13700.0
wajid           800.0

# Total Quantity per name

In [0]:
name_groups = df.groupby('Name')
name_total_quantity = pd.DataFrame(columns = ['Name', 'Total Quantity'])
for i, j in name_groups:
  name_total_quantity = name_total_quantity.append({'Name':i, 'Total Quantity': sum(j.Quantity)}, ignore_index = True)
  
name_total_quantity.sort_values(by = ['Total Quantity'], ascending = False, inplace = True)

In [104]:
name_total_quantity

        Name  Total Quantity
5      imran         22629.0
4     gulfam         19317.0
11  khurseed         17154.0
16    saddam         16740.0
0      akram         14760.0
2      bhura         14292.0
8     julfan         12480.0
6      jabir         11232.0
15     rasid          9744.0
17     wajid          8925.0
9      kayum          8316.0
18    zishan          7260.0
14  mukarram          4000.0
10      khan          2975.0
13   mujahid          2660.0
3     dinesh          1860.0
7      jahid          1740.0
12   mehmood          1478.0
1      amjad          1191.0

In [0]:
diesel_by_name.reset_index(inplace = True)

In [106]:
diesel_by_name.head(1)

Date   Name  Total Diesel
0     akram       21000.0

In [0]:
cash_by_name.reset_index(inplace = True)

In [108]:
cash_by_name.head(2)

Date   Name  Total Cash
0     akram      3700.0
1     bhura      2100.0

In [109]:
name_total_quantity.shape

(19, 2)

In [110]:
diesel_by_name.shape

(25, 2)

In [111]:
name1 - name2

{'bhada jcb', 'car', 'cash', 'sabir jcb', 'total', 'tractor', 'vakil jcb'}

In [112]:
names = name_total_quantity.Name.values
names

array(['imran', 'gulfam', 'khurseed', 'saddam', 'akram', 'bhura',
       'julfan', 'jabir', 'rasid', 'wajid', 'kayum', 'zishan', 'mukarram',
       'khan', 'mujahid', 'dinesh', 'jahid', 'mehmood', 'amjad'],
      dtype=object)

In [113]:
names = df.Name.unique()
names

array(['imran', 'julfan', 'gulfam', 'khurseed', 'saddam', 'jabir',
       'amjad', 'kayum', 'akram', 'bhura', 'wajid', 'mehmood', 'rasid',
       'zishan', 'jahid', 'khan', 'mujahid', 'mukarram', 'dinesh'],
      dtype=object)

In [114]:
diesel_by_name.head(1)

Date   Name  Total Diesel
0     akram       21000.0

In [0]:
final = pd.DataFrame(columns = ['Name','Rounds' , 'Total Quantity', 'Amount', 'Diesel', 'Amount - Diesel', 'Cash', 'Balance'])
for i in names:
    total_quantity = name_total_quantity[name_total_quantity.Name == i]['Total Quantity'].values[0]
    if i in diesel_by_name.Name.values:
      total_diesel = diesel_by_name[diesel_by_name.Name == i]['Total Diesel'].values[0]
    else:
      total_diesel = 0
    try:
        total_cash = cash_by_name[cash_by_name.Name == i]['Total Cash'].values[0]
    except:
        total_cash = 0
    #print(i, total_cash)
    final = final.append({'Name': i,'Total Quantity':total_quantity,
                            'Rounds':rounds_per_name.get(i),
                            'Amount':total_quantity*3,
                            'Diesel':total_diesel,
                            'Cash':total_cash,
                            'Amount - Diesel':total_quantity*3 - total_diesel,
                            'Balance':total_quantity*3 - total_diesel - total_cash},
                           ignore_index = True)

In [116]:
final.sort_values(by = 'Total Quantity', ascending = False, inplace = True)
final

        Name Rounds  Total Quantity  ...  Amount - Diesel    Cash  Balance
0      imran     57         22629.0  ...          32387.0  7600.0  24787.0
2     gulfam     47         19317.0  ...          27451.0  6100.0  21351.0
3   khurseed     44         17154.0  ...          19962.0  8650.0  11312.0
4     saddam     36         16740.0  ...          24220.0  5362.0  18858.0
8      akram     41         14760.0  ...          23280.0  3700.0  19580.0
9      bhura     36         14292.0  ...          18876.0  2100.0  16776.0
1     julfan     32         12480.0  ...          14940.0  4850.0  10090.0
5      jabir     27         11232.0  ...          17696.0  6040.0  11656.0
12     rasid     24          9744.0  ...          15232.0     0.0  15232.0
10     wajid     25          8925.0  ...          13775.0   800.0  12975.0
7      kayum     27          8316.0  ...           8448.0   587.0   7861.0
13    zishan     15          7260.0  ...          12280.0     0.0  12280.0
17  mukarram     10          4000.0  ...           7000.0     0.0   7000.0
15      khan      7          2975.0  ...           4925.0     0.0   4925.0
16   mujahid      7          2660.0  ...           3980.0     0.0   3980.0
18    dinesh      4          1860.0  ...           1760.0   560.0   1200.0
14     jahid      4          1740.0  ...           1220.0  1000.0    220.0
11   mehmood      4          1478.0  ...           4434.0     0.0   4434.0
6      amjad      3          1191.0  ...           -427.0     0.0   -427.0

[19 rows x 8 columns]

In [117]:
final.sum()

Name               imrangulfamkhurseedsaddamakrambhurajulfanjabir...
Rounds                                                           450
Total Quantity                                                178753
Amount                                                        536259
Diesel                                                        284820
Amount - Diesel                                               251439
Cash                                                           47349
Balance                                                       204090
dtype: object

In [118]:
final.append({'Name': 'Total', 'Rounds': sum(final.Rounds), 'Total Quantity':sum(final['Total Quantity']),	'Amount':sum(final.Amount),
              'Diesel':sum(final.Diesel), 'Amount - Diesel':sum(final['Amount - Diesel']), 'Cash':sum(final['Cash']), 
              'Balance':sum(final['Balance'])},
              ignore_index = True)

        Name Rounds  Total Quantity  ...  Amount - Diesel     Cash   Balance
0      imran     57         22629.0  ...          32387.0   7600.0   24787.0
1     gulfam     47         19317.0  ...          27451.0   6100.0   21351.0
2   khurseed     44         17154.0  ...          19962.0   8650.0   11312.0
3     saddam     36         16740.0  ...          24220.0   5362.0   18858.0
4      akram     41         14760.0  ...          23280.0   3700.0   19580.0
5      bhura     36         14292.0  ...          18876.0   2100.0   16776.0
6     julfan     32         12480.0  ...          14940.0   4850.0   10090.0
7      jabir     27         11232.0  ...          17696.0   6040.0   11656.0
8      rasid     24          9744.0  ...          15232.0      0.0   15232.0
9      wajid     25          8925.0  ...          13775.0    800.0   12975.0
10     kayum     27          8316.0  ...           8448.0    587.0    7861.0
11    zishan     15          7260.0  ...          12280.0      0.0   12280.0
12  mukarram     10          4000.0  ...           7000.0      0.0    7000.0
13      khan      7          2975.0  ...           4925.0      0.0    4925.0
14   mujahid      7          2660.0  ...           3980.0      0.0    3980.0
15    dinesh      4          1860.0  ...           1760.0    560.0    1200.0
16     jahid      4          1740.0  ...           1220.0   1000.0     220.0
17   mehmood      4          1478.0  ...           4434.0      0.0    4434.0
18     amjad      3          1191.0  ...           -427.0      0.0    -427.0
19     Total    450        178753.0  ...         251439.0  47349.0  204090.0

[20 rows x 8 columns]

In [119]:
vakil_diesel = diesel_by_name[diesel_by_name.Name == 'vakil jcb']['Total Diesel']
vakil_diesel

22    72000.0
Name: Total Diesel, dtype: float64

In [120]:
cash_diesel = diesel_by_name[diesel_by_name.Name == 'cash']['Total Diesel']
cash_diesel

5    53000.0
Name: Total Diesel, dtype: float64

In [121]:
diesel_to_people = final.sum().get('Diesel')
diesel_to_people

284820.0

In [122]:
car = diesel_by_name[diesel_by_name.Name == 'car']['Total Diesel'].values[0]
car

1500.0

In [123]:
final.sum(axis = 0, skipna = True)

Name               imrangulfamkhurseedsaddamakrambhurajulfanjabir...
Rounds                                                           450
Total Quantity                                                178753
Amount                                                        536259
Diesel                                                        284820
Amount - Diesel                                               251439
Cash                                                           47349
Balance                                                       204090
dtype: object

In [124]:
total_q = sum(final['Total Quantity'])
total_q

178753.0

# Total payable